# YOLOv8-XRay-Anomaly-Detection
# Ultralytics YOLO 🚀, AGPL-3.0 license

nc: 16  # Number of anomaly classes
scale: x  # x scale for depth/width

scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n summary
  s: [0.33, 0.50, 1024]  # YOLOv8s summary
  m: [0.67, 0.75, 768]    # YOLOv8m summary
  l: [1.00, 1.00, 512]    # YOLOv8l summary
  x: [1.00, 1.25, 512]    # YOLOv8x summary

# Các thông số liên quan đến loss và assign strategy
loss: 'Focal_WIoU' # Give an example，If used Focal_WIoU If the loss function, That is, modify the corresponding name
newhead: DynamicHead

# Backbone configuration
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (640->320)
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 (320->160)
  - [-1, 3, C2f_Biformer, [128, 8, True]]  # 2 (128 channels, 8 heads)
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 (160->80)
  - [-1, 6, C2f_Biformer, [256, 8, True]]  # 4 (256 channels, 8 heads)
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 (80->40)
  - [-1, 6, C2f_Biformer, [512, 8, True]]  # 6 (512 channels, 8 heads)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32 (40->20)
  - [-1, 3, C2f_Biformer, [1024, 8, True]]  # 8 (1024 channels, 8 heads)
  - [-1, 1, GAMAttention, [1024]]  # 9

# Neck configuration
neck:
  - [-1, 1, SSFF, [1024, 512]]  # 10 (P5)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # 12 (P4)
  - [-1, 3, C2f_FocalNeXt, [512]]  # 13
  - [-1, 1, SSFF, [512, 256]]  # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # 16 (P3)
  - [-1, 3, C2f_FocalNeXt, [256]]  # 17

# Head configuration
head:
  - [-1, 1, ASFF_3, [256, 2]]  # 18 (P3)
  - [-3, 1, ASFF_3, [512, 1]]  # 19 (P4)
  - [-5, 1, ASFF_3, [1024, 0]]  # 20 (P5)
  - [[18, 19, 20], 1, v10Detect, [
    nc, 
    [[10,13, 16,30, 33,23], [30,61, 62,45, 59,119], [116,90, 156,198, 373,326]],
    {
      'box': 0.1,
      'cls': 0.7,
      'dfl': 0.4,
      'fl_gamma': 1.5,
      'nms_iou': 0.45
    }
  ]]  # 21 (Detect)